RT-Thread-packages/gd32-arm-series/GD32H77x_78x/GD32H77x_78x_standard_peripheral/Include/gd32h77x_78x_usart.h
/* USARTx_BAUD */
#define USART_BAUD_FRADIV             BITS(0,3)                             /*!< fraction of baud-rate divider */
#define USART_BAUD_INTDIV             BITS(4,15)                            /*!< integer of baud-rate divider */

/* USARTx_GP */
#define USART_GP_PSC                  BITS(0,7)                             /*!< prescaler value for dividing the system clock */
#define USART_GP_GUAT                 BITS(8,15)                            /*!< guard time value in smartcard mode */

/* USARTx_RT */
#define USART_RT_RT                   BITS(0,23)                            /*!< receiver timeout threshold */
#define USART_RT_BL                   BITS(24,31)                           /*!< block length */

/* USARTx_CMD */
#define USART_CMD_SBKCMD              BIT(1)                                /*!< send break command */
#define USART_CMD_MMCMD               BIT(2)                                /*!< mute mode command */
#define USART_CMD_RXFCMD              BIT(3)                                /*!< receive data flush command */
#define USART_CMD_TXFCMD              BIT(4)                                /*!< transmit data flush request */

/* USARTx_STAT */
#define USART_STAT_PERR               BIT(0)                                /*!< parity error flag */
#define USART_STAT_FERR               BIT(1)                                /*!< frame error flag */
#define USART_STAT_NERR               BIT(2)                                /*!< noise error flag */
#define USART_STAT_ORERR              BIT(3)                                /*!< overrun error */
#define USART_STAT_IDLEF              BIT(4)                                /*!< idle line detected flag */
#define USART_STAT_RBNE               BIT(5)                                /*!< read data buffer not empty(when FIFO is disabled) */
#define USART_STAT_RFNE               BIT(5)                                /*!< receive FIFO not empty(when FIFO is enabled) */
#define USART_STAT_TC                 BIT(6)                                /*!< transmission completed */
#define USART_STAT_TBE                BIT(7)                                /*!< transmit data register empty(when FIFO is disabled) */
#define USART_STAT_TFNF               BIT(7)                                /*!< transmit FIFO not full(when FIFO is enabled) */
#define USART_STAT_LBDF               BIT(8)                                /*!< LIN break detected flag */
#define USART_STAT_CTSF               BIT(9)                                /*!< CTS change flag */
#define USART_STAT_CTS                BIT(10)                               /*!< CTS level */
#define USART_STAT_RTF                BIT(11)                               /*!< receiver timeout flag */
#define USART_STAT_EBF                BIT(12)                               /*!< end of block flag */
#define USART_STAT_AMF1               BIT(13)                               /*!< address 1 character match flag */
#define USART_STAT_BSY                BIT(16)                               /*!< busy flag */
#define USART_STAT_AMF0               BIT(17)                               /*!< address 0 character match flag */
#define USART_STAT_SBF                BIT(18)                               /*!< send break flag */
#define USART_STAT_RWU                BIT(19)                               /*!< receiver wakeup from mute mode */
#define USART_STAT_WUF                BIT(20)                               /*!< wakeup from deep-sleep mode flag */
#define USART_STAT_TEA                BIT(21)                               /*!< transmit enable acknowledge flag */
#define USART_STAT_REA                BIT(22)                               /*!< receive enable acknowledge flag */

/* USARTx_INTC */
#define USART_INTC_PEC                BIT(0)                                /*!< clear parity error */
#define USART_INTC_FEC                BIT(1)                                /*!< clear frame error flag */
#define USART_INTC_NEC                BIT(2)                                /*!< clear noise detected */
#define USART_INTC_OREC               BIT(3)                                /*!< clear overrun error */
#define USART_INTC_IDLEC              BIT(4)                                /*!< clear idle line detected */
#define USART_INTC_TCC                BIT(6)                                /*!< clear transmission complete */
#define USART_INTC_LBDC               BIT(8)                                /*!< clear LIN break detected */
#define USART_INTC_CTSC               BIT(9)                                /*!< clear CTS change */
#define USART_INTC_RTC                BIT(11)                               /*!< clear receiver timeout */
#define USART_INTC_EBC                BIT(12)                               /*!< clear end of timeout */
#define USART_INTC_AMC1               BIT(16)                               /*!< clear address 1 character match */
#define USART_INTC_AMC0               BIT(17)                               /*!< clear address 0 character match */
#define USART_INTC_WUC                BIT(20)                               /*!< clear wakeup from deep-sleep mode */

/* USARTx_RDATA */
#define USART_RDATA_RDATA             BITS(0,9)                             /*!< receive data value */

/* USARTx_TDATA */
#define USART_TDATA_TDATA             BITS(0,9)                             /*!< transmit data value */

/* USARTx_CHC */
#define USART_CHC_HCM                 BIT(0)                                /*!< hardware flow control coherence mode */
#define USART_CHC_EPERR               BIT(8)                                /*!< early parity error flag */

/* USARTx_FCS */
#define USART_FCS_ELNACK              BIT(0)                                 /*!< early NACK when smartcard mode is selected */
#define USART_FCS_RFCNT3_4            BITS(1,2)                              /*!< receive FIFO counter number RFCNT[4:3] */
#define USART_FCS_RFT                 BIT(4)                                 /*!< receive FIFO threshold flag */
#define USART_FCS_TFT                 BIT(5)                                 /*!< transmit FIFO threshold flag */
#define USART_FCS_TFE                 BIT(6)                                 /*!< transmit FIFO empty flag */
#define USART_FCS_TFF                 BIT(7)                                 /*!< transmit FIFO full flag */
#define USART_FCS_FEN                 BIT(8)                                 /*!< enable FIFO */
#define USART_FCS_RFFIE               BIT(9)                                 /*!< enable receive FIFO full interrupt */
#define USART_FCS_RFE                 BIT(10)                                /*!< receive FIFO empty flag */
#define USART_FCS_RFF                 BIT(11)                                /*!< receive FIFO full flag */
#define USART_FCS_RFCNT0_2            BITS(12,14)                            /*!< receive FIFO counter number RFCNT[2:0] */
#define USART_FCS_RFFIF               BIT(15)                                /*!< receive FIFO full interrupt flag */
#define USART_FCS_RFTCFG              BITS(16,18)                            /*!< receive FIFO threshold configuration */
#define USART_FCS_TFTCFG              BITS(19,21)                            /*!< transmit FIFO threshold configuration */
#define USART_FCS_RFTIF               BIT(22)                                /*!< receive FIFO threshold interrupt flag */
#define USART_FCS_TFEIF               BIT(24)                                /*!< transmit FIFO empty interrupt flag */
#define USART_FCS_TFTIF               BIT(25)                                /*!< transmit FIFO threshold interrupt flag */
#define USART_FCS_TFEC                BIT(26)                                /*!< clear transmit FIFO empty flag */
#define USART_FCS_RFTIE               BIT(27)                                /*!< enable receive FIFO threshold interrupt */
#define USART_FCS_TFTIE               BIT(29)                                /*!< enable transmit FIFO threshold interrupt */
#define USART_FCS_TFEIE               BIT(31)                                /*!< enable transmit FIFO empty interrupt */

/* constants definitions */
/* define the USART bit position and its register index offset */
#define USART_REGIDX_BIT(regidx, bitpos)     (((uint32_t)(regidx) << 6) | (uint32_t)(bitpos))
#define USART_REG_VAL(usartx, offset)        (REG32((usartx) + (((uint32_t)(offset) & 0x0000FFFFU) >> 6)))
#define USART_BIT_POS(val)                   ((uint32_t)(val) & 0x0000001FU)
#define USART_REGIDX_BIT2(regidx, bitpos, regidx2, bitpos2)   (((uint32_t)(regidx2) << 22) | (uint32_t)((bitpos2) << 16)\
                                                              | (((uint32_t)(regidx) << 6) | (uint32_t)(bitpos)))
#define USART_REG_VAL2(usartx, offset)       (REG32((usartx) + ((uint32_t)(offset) >> 22)))
#define USART_BIT_POS2(val)                  (((uint32_t)(val) & 0x001F0000U) >> 16)

/* register offset */
#define USART_CTL0_REG_OFFSET                ((uint32_t)0x00000000U)        /*!< CTL0 register offset */
#define USART_CTL1_REG_OFFSET                ((uint32_t)0x00000004U)        /*!< CTL1 register offset */
#define USART_CTL2_REG_OFFSET                ((uint32_t)0x00000008U)        /*!< CTL2 register offset */
#define USART_STAT_REG_OFFSET                ((uint32_t)0x0000001CU)        /*!< STAT register offset */
#define USART_CHC_REG_OFFSET                 ((uint32_t)0x000000C0U)        /*!< CHC register offset */
#define USART_FCS_REG_OFFSET                 ((uint32_t)0x000000D0U)        /*!< FCS register offset */

/* USART flags */
typedef enum{
    /* flags in STAT register */
    USART_FLAG_REA = USART_REGIDX_BIT(USART_STAT_REG_OFFSET, 22U),          /*!< receive enable acknowledge flag */
    USART_FLAG_TEA = USART_REGIDX_BIT(USART_STAT_REG_OFFSET, 21U),          /*!< transmit enable acknowledge flag */
    USART_FLAG_WU = USART_REGIDX_BIT(USART_STAT_REG_OFFSET, 20U),           /*!< wakeup from Deep-sleep mode flag */
    USART_FLAG_RWU = USART_REGIDX_BIT(USART_STAT_REG_OFFSET, 19U),          /*!< receiver wakeup from mute mode */
    USART_FLAG_SB = USART_REGIDX_BIT(USART_STAT_REG_OFFSET, 18U),           /*!< send break flag */
    USART_FLAG_AM0 = USART_REGIDX_BIT(USART_STAT_REG_OFFSET, 17U),          /*!< ADDR0 match flag */
    USART_FLAG_BSY = USART_REGIDX_BIT(USART_STAT_REG_OFFSET, 16U),          /*!< busy flag */
    USART_FLAG_AM1 = USART_REGIDX_BIT(USART_STAT_REG_OFFSET, 13U),          /*!< ADDR1 match flag */
    USART_FLAG_EB = USART_REGIDX_BIT(USART_STAT_REG_OFFSET, 12U),           /*!< end of block flag */
    USART_FLAG_RT = USART_REGIDX_BIT(USART_STAT_REG_OFFSET, 11U),           /*!< receiver timeout flag */
    USART_FLAG_CTS = USART_REGIDX_BIT(USART_STAT_REG_OFFSET, 10U),          /*!< CTS level */
    USART_FLAG_CTSF = USART_REGIDX_BIT(USART_STAT_REG_OFFSET, 9U),          /*!< CTS change flag */
    USART_FLAG_LBD = USART_REGIDX_BIT(USART_STAT_REG_OFFSET, 8U),           /*!< LIN break detected flag */
    USART_FLAG_TBE = USART_REGIDX_BIT(USART_STAT_REG_OFFSET, 7U),           /*!< transmit data buffer empty(when FIFO is disabled) */
    USART_FLAG_TFNF = USART_REGIDX_BIT(USART_STAT_REG_OFFSET, 7U),          /*!< transmit FIFO not full(when FIFO is enabled) */
    USART_FLAG_TC = USART_REGIDX_BIT(USART_STAT_REG_OFFSET, 6U),            /*!< transmission complete */
    USART_FLAG_RBNE = USART_REGIDX_BIT(USART_STAT_REG_OFFSET, 5U),          /*!< read data buffer not empty(when FIFO is disabled) */
    USART_FLAG_RFNE = USART_REGIDX_BIT(USART_STAT_REG_OFFSET, 5U),          /*!< receive FIFO not empty(when FIFO is enabled) */
    USART_FLAG_IDLE = USART_REGIDX_BIT(USART_STAT_REG_OFFSET, 4U),          /*!< IDLE line detected flag */
    USART_FLAG_ORERR = USART_REGIDX_BIT(USART_STAT_REG_OFFSET, 3U),         /*!< overrun error */
    USART_FLAG_NERR = USART_REGIDX_BIT(USART_STAT_REG_OFFSET, 2U),          /*!< noise error flag */
    USART_FLAG_FERR = USART_REGIDX_BIT(USART_STAT_REG_OFFSET, 1U),          /*!< frame error flag */
    USART_FLAG_PERR = USART_REGIDX_BIT(USART_STAT_REG_OFFSET, 0U),          /*!< parity error flag */
    /* flags in CHC register */
    USART_FLAG_EPERR = USART_REGIDX_BIT(USART_CHC_REG_OFFSET, 8U),          /*!< early parity error flag */
    /* flags in FCS register */
    USART_FLAG_RFF = USART_REGIDX_BIT(USART_FCS_REG_OFFSET, 11U),           /*!< receive FIFO full flag */
    USART_FLAG_RFE = USART_REGIDX_BIT(USART_FCS_REG_OFFSET, 10U),           /*!< receive FIFO empty flag */
    USART_FLAG_TFF = USART_REGIDX_BIT(USART_FCS_REG_OFFSET, 7U),            /*!< transmit FIFO full flag */
    USART_FLAG_TFE = USART_REGIDX_BIT(USART_FCS_REG_OFFSET, 6U),            /*!< transmit FIFO empty flag */
    USART_FLAG_TFT = USART_REGIDX_BIT(USART_FCS_REG_OFFSET, 5U),            /*!< transmit FIFO threshold reach flag */
    USART_FLAG_RFT = USART_REGIDX_BIT(USART_FCS_REG_OFFSET, 4U)             /*!< receive FIFO threshold reach flag */
}usart_flag_enum;

/* USART interrupt flags */
typedef enum
{
    /* interrupt flags in CTL0 register */
    USART_INT_FLAG_AM1 = USART_REGIDX_BIT2(USART_CTL0_REG_OFFSET, 31U, USART_STAT_REG_OFFSET, 13U),      /*!< address 1 match interrupt and flag */
    USART_INT_FLAG_EB = USART_REGIDX_BIT2(USART_CTL0_REG_OFFSET, 27U, USART_STAT_REG_OFFSET, 12U),       /*!< end of block interrupt and flag */
    USART_INT_FLAG_RT = USART_REGIDX_BIT2(USART_CTL0_REG_OFFSET, 26U, USART_STAT_REG_OFFSET, 11U),       /*!< receiver timeout interrupt and flag */
    USART_INT_FLAG_AM0 = USART_REGIDX_BIT2(USART_CTL0_REG_OFFSET, 14U, USART_STAT_REG_OFFSET, 17U),      /*!< address 0 match interrupt and flag */
    USART_INT_FLAG_PERR = USART_REGIDX_BIT2(USART_CTL0_REG_OFFSET, 8U, USART_STAT_REG_OFFSET, 0U),       /*!< parity error interrupt and flag */
    USART_INT_FLAG_TBE = USART_REGIDX_BIT2(USART_CTL0_REG_OFFSET, 7U, USART_STAT_REG_OFFSET, 7U),        /*!< transmitter buffer empty interrupt and flag(when FIFO is disabled) */
    USART_INT_FLAG_TFNF = USART_REGIDX_BIT2(USART_CTL0_REG_OFFSET, 7U, USART_STAT_REG_OFFSET, 7U),       /*!< transmit FIFO not full interrupt and flag(when FIFO is enabled) */
    USART_INT_FLAG_TC = USART_REGIDX_BIT2(USART_CTL0_REG_OFFSET, 6U, USART_STAT_REG_OFFSET, 6U),         /*!< transmission complete interrupt and flag */
    USART_INT_FLAG_RBNE = USART_REGIDX_BIT2(USART_CTL0_REG_OFFSET, 5U, USART_STAT_REG_OFFSET, 5U),       /*!< read data buffer not empty interrupt and flag(when FIFO is disabled) */
    USART_INT_FLAG_RFNE = USART_REGIDX_BIT2(USART_CTL0_REG_OFFSET, 5U, USART_STAT_REG_OFFSET, 5U),       /*!< receive FIFO not empty interrupt and flag(when FIFO is enabled) */
    USART_INT_FLAG_RBNE_ORERR = USART_REGIDX_BIT2(USART_CTL0_REG_OFFSET, 5U, USART_STAT_REG_OFFSET, 3U), /*!< read data buffer not empty interrupt and overrun error flag(when FIFO is disabled) */
    USART_INT_FLAG_RFNE_ORERR = USART_REGIDX_BIT2(USART_CTL0_REG_OFFSET, 5U, USART_STAT_REG_OFFSET, 3U), /*!< receive FIFO not empty interrupt and overrun error flag(when FIFO is enabled) */
    USART_INT_FLAG_IDLE = USART_REGIDX_BIT2(USART_CTL0_REG_OFFSET, 4U, USART_STAT_REG_OFFSET, 4U),       /*!< IDLE line detected interrupt and flag */
    /* interrupt flags in CTL1 register */
    USART_INT_FLAG_LBD = USART_REGIDX_BIT2(USART_CTL1_REG_OFFSET, 6U, USART_STAT_REG_OFFSET, 8U),        /*!< LIN break detected interrupt and flag */
    /* interrupt flags in CTL2 register */
    USART_INT_FLAG_WU = USART_REGIDX_BIT2(USART_CTL2_REG_OFFSET, 22U, USART_STAT_REG_OFFSET, 20U),       /*!< wakeup from deep-sleep mode interrupt and flag */
    USART_INT_FLAG_CTS = USART_REGIDX_BIT2(USART_CTL2_REG_OFFSET, 10U, USART_STAT_REG_OFFSET, 9U),       /*!< CTS interrupt and flag */
    USART_INT_FLAG_ERR_NERR = USART_REGIDX_BIT2(USART_CTL2_REG_OFFSET, 0U, USART_STAT_REG_OFFSET, 2U),   /*!< error interrupt and noise error flag */
    USART_INT_FLAG_ERR_ORERR = USART_REGIDX_BIT2(USART_CTL2_REG_OFFSET, 0U, USART_STAT_REG_OFFSET, 3U),  /*!< error interrupt and overrun error */
    USART_INT_FLAG_ERR_FERR = USART_REGIDX_BIT2(USART_CTL2_REG_OFFSET, 0U, USART_STAT_REG_OFFSET, 1U),   /*!< error interrupt and frame error flag */
    /* interrupt flags in FCS register */
    USART_INT_FLAG_TFT = USART_REGIDX_BIT2(USART_FCS_REG_OFFSET, 29U, USART_FCS_REG_OFFSET, 25U),        /*!< transmit FIFO threshold reach interrupt and flag */
    USART_INT_FLAG_TFE = USART_REGIDX_BIT2(USART_FCS_REG_OFFSET, 31U, USART_FCS_REG_OFFSET, 24U),        /*!< transmit FIFO empty interrupt and flag */
    USART_INT_FLAG_RFT = USART_REGIDX_BIT2(USART_FCS_REG_OFFSET, 27U, USART_FCS_REG_OFFSET, 22U),        /*!< receive FIFO threshold reach interrupt and flag */
    USART_INT_FLAG_RFF = USART_REGIDX_BIT2(USART_FCS_REG_OFFSET, 9U, USART_FCS_REG_OFFSET, 15U)          /*!< receive FIFO full interrupt and flag */
}usart_interrupt_flag_enum;

